app/Helpers/my_helper.php

SELECT *
FROM `users`
WHERE `users`.`id` = '4'
---
    function current_user()
    {
        $userId = session()->get('user_id');
        if (!$userId) {
            return null;
        }

        $userModel = new UserModel();
        return $userModel->find($userId);

SELECT COUNT(*) AS `numrows` FROM `inventory_supplier`
---
function inventory_supplier_count(): int
{
    $db = \Config\Database::connect();
    return $db->table('inventory_supplier')->countAll();

SELECT COUNT(*) AS `numrows` FROM `inventory`
---
function inventory_item_count(): int
{
    $db = \Config\Database::connect();
    return $db->table('inventory')->countAll();

SELECT COUNT(*) AS `numrows`
FROM `inventory`
WHERE   (
`reordering_level` > current_quantity
OR `current_quantity` IS NULL
OR `current_quantity` < 1
 )
---
function low_stock_inventory_count(): int
{
    $db = \Config\Database::connect();
    $builder = $db->table('inventory');

    $builder->groupStart()
        ->where('reordering_level > current_quantity')
        ->orWhere('current_quantity IS NULL')
        ->orWhere('current_quantity <', 1)
        ->groupEnd();

    return $builder->countAllResults();

SELECT `inventory`.`icon`, `inventory`.`name`, `inventory`.`description`, `inventory`.`current_quantity`, `inventory`.`current_price`, `inventory`.`reordering_level`, `inventory_type`.`name` as `inventory_type_name`
FROM `inventory`
LEFT JOIN `inventory_type` ON `inventory`.`inventory_type` = `inventory_type`.`id`
WHERE   (
`reordering_level` > current_quantity
OR `current_quantity` IS NULL
OR `current_quantity` < 1
 )
---
function get_low_stock_items(): array
{
    $db = \Config\Database::connect();
    $builder = $db->table('inventory');
    $builder->select('inventory.icon, inventory.name, inventory.description, inventory.current_quantity, inventory.current_price, inventory.reordering_level, inventory_type.name as inventory_type_name');
    $builder->join('inventory_type', 'inventory.inventory_type = inventory_type.id', 'left');

    $builder->groupStart()
        ->where('reordering_level > current_quantity')
        ->orWhere('current_quantity IS NULL')
        ->orWhere('current_quantity <', 1)
        ->groupEnd();

    return $builder->get()->getResultArray();

SELECT COUNT(*) AS `numrows` FROM `users`
---
function users_count(): int
{
    $db = \Config\Database::connect();
    return $db->table('users')->countAll();