app/Controllers/DistributorController.php

    public function getDistributorList()
    {
        $model = new \App\Models\DistributorModel();
        $data = $model->select('id, name, type')->findAll();
---
SELECT `id`, `name`, `type`
FROM `distributor`