app/Controllers/InventoryController.php

SELECT *
FROM `inventory_type`
---
    public function index()
    {
        $inventoryTypeModel = new InventoryTypeModel();
        $data['inventory_type_data'] = $inventoryTypeModel->findAll();

SELECT *
FROM `sub_inventory_type`
WHERE `inventory_type_id` = '2'
SELECT *
FROM `inventory_type`
WHERE `inventory_type`.`id` = '2'
---
    public function sub_inventory_type($inventory_type_id)
    {
        $subInventoryTypeModel = new SubInventoryTypeModel();
        $data['sub_inventory_type_data'] = $subInventoryTypeModel->where('inventory_type_id', $inventory_type_id)->findAll();


        $inventoryTypeModel = new InventoryTypeModel();
        $id = $inventory_type_id;
        $data['inventory_type_data'] = $inventoryTypeModel->find($id);

SELECT *
FROM `sub_inventory_type`
WHERE `sub_inventory_type`.`id` = '6'
---
    public function showv2($inventory_type_id, $sub_inventory_type)
    {

        $inventoryModel = new InventoryModel();

        $perPage = 10;


        $inventoryTypeModel = new InventoryTypeModel();
        $data['inventory_type_parse'] = $inventoryTypeModel->find($inventory_type_id);

SELECT *
FROM `inventory_type`
---

        // Fetch inventory types for the dropdown
        $inventoryTypeModel = new InventoryTypeModel();
        $data['inventory_type_data'] = $inventoryTypeModel->findAll();